# CutoutNotCuttingAnythingDeleteOpening Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CutoutNotCuttingAnythingDeleteOpening Property
BuiltInFailures..::..CutFailures Class See Also
---
Opening not cutting anything.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CutoutNotCuttingAnythingDeleteOpening { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CutoutNotCuttingAnythingDeleteOpening As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CutoutNotCuttingAnythingDeleteOpening {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace